app/views/book_comments/create.js.erb

$('#books_comment').html("<%= j(render 'books/bookcomment', book: @book) %>");
$('#comment_count').html("コメント：<%= @book.book_comments.count %>");
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]