app/views/book_comments/destroy.js.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
$('#comment_<%= @book_comment.id %>').remove();
$('#comment_count').html("コメント：<%= @book.book_comments.count %>");