app/views/users/show.html.erb

	<tbody>
		<% @user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]