app/views/books/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
				<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
				いいね：<%= book.favorites.count %></td>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
				<i class="far fa-heart"></i>
				いいね：<%= book.favorites.count %>