app/views/books/index.html.erb

										      	<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
										      	いいね：<%= book.favorites.count %></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

										       <i class="far fa-heart"></i>
										      いいね：<%= book.favorites.count %></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

										<% end %>									</td>
									<td>コメント数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]