app/views/books/show.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
										<td id="books_buttons_<%= @book.id %>"><%= render 'books/favorite',book: @book %></td>
							      <td id="comment_count">コメント：<%= @book.book_comments.count %></td>