app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
			　<table>
					　<% @book.book_comments.each do |book_comment| %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
									<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
									いいね：<%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
										 <i class="far fa-heart"></i>
										 いいね：<%= @book.favorites.count %>