app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new_book = Book.new
  	@book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jytjy"], ["body", "fj"], ["user_id", 1], ["created_at", "2020-02-23 12:01:45.943783"], ["updated_at", "2020-02-23 12:01:45.943783"]]
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  if @book.save #入力されたデータをdbに保存する。

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def update
  	@book = Book.find(params[:id])