app/controllers/searchs_controller.rb

	def search
    @books = Book.search(params[:search],params[:category],params[:select])
    @users = User.search(params[:search],params[:category],params[:select])
---
SELECT "books".* FROM "books" WHERE (title LIKE '%ゆ%' or body LIKE '%ゆ%')
SELECT "users".* FROM "users" WHERE (name LIKE ?)