app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ゆう"], ["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-02-23 15:13:30.606505"], ["id", 1]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def following
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    @user = User.find(params[:id])